#include <iostream>

//TASKS
// Задача 0
// По въведено число n и намерете сумата на от n до 0;

// Задача 1
// По въведени от стандартния вход две цели числа да се изведе произведението в интервала между тях.

// Задача 2
// Да се напише програма, която въвежда от клавиатурата цяло число n и масив от n реални числа. Да се намерят минималния и максималния елемент на масива.

// Задача 3
// Да се напише програма, която въвежда от клавиатурата цяло число n и масив от n реални числа. Да се намерят минималния и максималния елемент на масива. Да се разменят местата им в масива и да се изведе новия масив.

// Задача 4
// Да се напише програма, която въвежда от клавиатурата цяло число n и масив от n цели числа. Да се намерят и изведат: първият неотрицателен елемент на масива и сумата на елементите след него. Ако няма такива да се изведе подходящо съобщение.

// Задача 5
// От клавиатурата се въвеждат N числа. Да се изведат в обратен ред.   

// Задача 6
// Да се напише програма, която въвежда от клавиатурата низ и символ. Да се изведе колко пъти се среща символът в низа и , ако се среща да го замести със символа *.

// Задача 7
// Да се напише програма, която въвежда от клавиатурата цяло число n и масив от n цели числа. Да се провери дали масивът е симетричен(огледален, палиндром).

// Бонус 0 - домашно
// Направете следния диамант:
// Входни данни - цяло число показващо броя на редовете до най - широкия от страна на символи ред.

// Бонус 1 - домашно
// Да се напише програма, която при въведено нечетно число от клавиатурата да извежда на екрана пясъчен часовник с ширина, равна на въведеното число.
    
using namespace std;

int main() {
//    //---------------------------------------------------------------------------------------------
//    //WEEK 4
//    //---------------------------------------------------------------------------------------------
//    //---------------------------------------------------------------------------------------------
//    //Task 0
//    //---------------------------------------------------------------------------------------------
//    int n0, sum = 0;
//    cin >> n0;
//    for (int i = 1; i <= n0; i++) {
//        sum += i;
//    }
//    cout << sum << endl;
//
//
//    //---------------------------------------------------------------------------------------------
//    //Task 1
//    //---------------------------------------------------------------------------------------------
//    int n1, n11, add = 1;
//    cin >> n1 >> n11;
//    for (int i = n1; i <= n11; i++) {
//        add *= i;
//    }
//    cout << add << endl;

//    //---------------------------------------------------------------------------------------------
//    //Task 2
//    //---------------------------------------------------------------------------------------------
//    int n2;
//    cin >> n2;
//    double arr[100], min = INT_MAX, max = INT_MIN;
//    for (int i = 0; i < n2; ++i) {
//        cin >> arr[i];
//    }
//    for (int i = 0; i < n2; ++i) {
//        if (arr[i] > max) {
//            max = arr[i];
//        }
//        else if(arr[i] < min) {
//            min = arr[i];
//        }
//    }
//    cout << max << endl << min << endl;

//    //---------------------------------------------------------------------------------------------
//    //Task 3
//    //---------------------------------------------------------------------------------------------
//    int n2;
//    cin >> n2;
//    double arr[100], min = INT_MAX, max = INT_MIN;
//    for (int i = 0; i < n2; ++i) {
//        cin >> arr[i];
//    }
//    for (int i = 0; i < n2; ++i) {
//        if (arr[i] > max) {
//            max = arr[i];
//        }
//        else if(arr[i] < min) {
//            min = arr[i];
//        }
//    }
//    for (int i = 0; i < n2; ++i) {
//        if(arr[i] == min) {
//            arr[i] = max;
//        }
//        else if(arr[i] == max){
//            arr[i] = min;
//        }
//        cout << arr[i] << ", ";
//    }
//    cout << endl;


//    //---------------------------------------------------------------------------------------------
//    //Task 4
//    //---------------------------------------------------------------------------------------------
//    int n2, sum = 0, negative = 0;
//    cin >> n2;
//    int arr[100];
//    for (size_t i = 0; i < n2; ++i) {
//        cin >> arr[i];
//    }
//    for (size_t i = 0; i < n2; ++i) {
//        if (arr[i] < 0) {
//            negative = i;
//            break;
//        }
//    }
//    for (size_t i = negative; i < n2; ++i) {
//        sum += arr[i];
//    }
//    cout << sum << endl;

//    //---------------------------------------------------------------------------------------------
//    //Task 5
//    //---------------------------------------------------------------------------------------------
//    int n2, sum = 0, negative = 0;
//    cin >> n2;
//    int arr[100];
//    for (size_t i = 0; i < n2; ++i) {
//        cin >> arr[i];
//    }
//    for (int i = n2 - 1; i >= 0; --i) {
//        cout << arr[i] << " ";
//    }
//    cout << endl;

//    //---------------------------------------------------------------------------------------------
//    //Task 6
//    //---------------------------------------------------------------------------------------------
//    char str[100], sym;
//    int n5, counter = 0;
//    cin >> n5;
//    for (size_t i = 0; i < n5; ++i) {
//        cin >> str[i];
//    }
//    cin >> sym;
//    str[n5] = '\0';
//    for (size_t i = 0; i < n5; ++i) {
//        if (str[i] == sym) {
//           counter ++;
//           str[i] = '*';
//        }
//    }
//    cout << "The symbol " << sym << "contains " << counter << "times." << endl;
//    cout << str << endl;

//    //---------------------------------------------------------------------------------------------
//    //Task 7
//    //---------------------------------------------------------------------------------------------
//    int n2;
//    bool isTrue = true;
//    cin >> n2;
//    double arr[100];
//    for (size_t i = 0; i < n2; ++i) {
//        cin >> arr[i];
//    }
//    for (size_t i = 0; i < n2; ++i) {
//        for (int j = n2; j >= 0; --j) {
//            if(arr[i] == arr[j]){
//                isTrue = false;
//                break;
//            }
//        }
//    }
//    if(isTrue){
//        cout << "Palindrome" << endl;
//    }
//    else {
//        cout << "No palindrome" << endl;
//    }

//    //---------------------------------------------------------------------------------------------
//    //Bonus 0
//    //---------------------------------------------------------------------------------------------
//    int n0b;
//    cin >> n0b;

//    for (size_t i = 1; i <= n0b; ++i) {
//        for (size_t j = n0b; j > i ; --j) {
//            cout << " ";
//        }
//        for (size_t t = 0; t < i * 2 - 1; ++t) {
//            cout << "*";
//        }
//        for (size_t k = n0b; k > i; --k) {
//            cout << " ";
//        }
//        cout << endl;
//    }
//    for(size_t i = n0b - 1; i >= 1; --i){
//        for (size_t j = n0b; j > i ; --j) {
//            cout << " ";
//        }
//        for (size_t t = 0; t < i * 2 - 1; ++t) {
//            cout << "*";
//        }
//        for (size_t k = n0b; k > i; --k) {
//            cout << " ";
//       }
//        cout << endl;
//    }
    
//    //---------------------------------------------------------------------------------------------
//    //Bonus 1
//    //---------------------------------------------------------------------------------------------
//    int n1b;
//    cin >> n1b;
//
//    for (size_t i = 0; i < n1b; ++i) {
//        cout << "*";
//    }
//    cout << endl;
    
//    for (size_t i = 1; i <= n1b - 2; ++i) {
//        cout << " ";
//        for (size_t j = 1; j <= n1b - 2; ++j) {
//            if (i == j || j == (n1b - 1) - i) {
//                cout << "*";
//            }
//            else {
//                cout << " ";
//            }
//        }
//        cout << " " << endl;
//   }
//    for (size_t i = 0; i < n1b; ++i) {
//        cout << "*";
//    }
//    cout << endl;


    return 0;
}
